[NoCoverage] BlockStatement
src/builders/PedidoBuilder.js:10:21
-     comCartao(cartao) { this._cartao = cartao; return this; }
+     comCartao(cartao) {}

[NoCoverage] BlockStatement
src/builders/PedidoBuilder.js:13:14
-     semValor() { this._valor = null; return this; }
+     semValor() {}

[Survived] ObjectLiteral
src/builders/PedidoBuilder.js:5:20
-       this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
+       this._cartao = {};
Tests ran:
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve salvar o pedido no repositório exatamente uma vez
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
  and 12 more tests!

[Survived] StringLiteral
src/builders/PedidoBuilder.js:5:30
-       this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
+       this._cartao = { numero: "", validade: '12/2028', cvv: '123' };
Tests ran:
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve salvar o pedido no repositório exatamente uma vez
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
  and 12 more tests!

[Survived] StringLiteral
src/builders/PedidoBuilder.js:5:60
-       this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
+       this._cartao = { numero: '4111111111111111', validade: "", cvv: '123' };
Tests ran:
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve salvar o pedido no repositório exatamente uma vez
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
  and 12 more tests!

[Survived] StringLiteral
src/builders/PedidoBuilder.js:5:76
-       this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
+       this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: "" };
Tests ran:
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve salvar o pedido no repositório exatamente uma vez
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
  and 12 more tests!

[NoCoverage] StringLiteral
src/services/CheckoutService.js:26:35
-         .catch(err => console.error('Falha ao enviar e-mail:', err.message));
+         .catch(err => console.error("", err.message));

[Survived] ArrowFunction
src/services/CheckoutService.js:26:14
-         .catch(err => console.error('Falha ao enviar e-mail:', err.message));
+         .catch(() => undefined);
Tests ran:
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve salvar o pedido no repositório exatamente uma vez
    CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
  and 1 more test!

[Survived] StringLiteral
src/services/CheckoutService.js:37:19
-       console.error('Falha catastrófica no gateway bancário:', error.message);
+       console.error("", error.message);
Tests ran:
    CheckoutService Caminho N6 — ERRO_GATEWAY (falha de infraestrutura / catch) deve retornar null quando o gateway lança exceção
    CheckoutService Caminho N6 — ERRO_GATEWAY (falha de infraestrutura / catch) deve salvar o pedido com status ERRO_GATEWAY
    CheckoutService Caminho N6 — ERRO_GATEWAY (falha de infraestrutura / catch) MOCK — NÃO deve enviar e-mail quando há erro de infraestrutura
  and 1 more test!
