[Killed] BlockStatement
src/builders/PedidoBuilder.js:2:17
 class PedidoBuilder {
-  constructor() {
-    this._clienteEmail = 'cliente@entregasja.com';
-    this._valor = 100.00;
-    this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
-    this._status = 'PENDENTE';
-  }
+  constructor() {}
   comEmail(email) { this._clienteEmail = email; return this; }
   comValor(valor) { this._valor = valor; return this; }
killedBy: CheckoutService PedidoBuilder — Data Builder Pattern deve construir pedido com valores padrão sensatos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cliente@entregasja.com"
Received: undefined

[Killed] StringLiteral
src/builders/PedidoBuilder.js:5:30
   constructor() {
     this._clienteEmail = 'cliente@entregasja.com';
     this._valor = 100.00;
-    this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
+    this._cartao = { numero: "", validade: '12/2028', cvv: '123' };
     this._status = 'PENDENTE';
   }
killedBy: PedidoBuilder — campos do cartão padrão (mata M1, M2, M3, M4) cartão padrão deve ter número não vazio
statusReason: Error: expect(received).toBeTruthy()

Received: ""

[Killed] BlockStatement
src/builders/PedidoBuilder.js:8:19
     this._cartao = { numero: '4111111111111111', validade: '12/2028', cvv: '123' };
     this._status = 'PENDENTE';
   }
-  comEmail(email) { this._clienteEmail = email; return this; }
+  comEmail(email) {}
   comValor(valor) { this._valor = valor; return this; }
   comCartao(cartao) { this._cartao = cartao; return this; }
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'comValor')

[Killed] BlockStatement
src/builders/PedidoBuilder.js:9:19
     this._status = 'PENDENTE';
   }
   comEmail(email) { this._clienteEmail = email; return this; }
-  comValor(valor) { this._valor = valor; return this; }
+  comValor(valor) {}
   comCartao(cartao) { this._cartao = cartao; return this; }
   semEmail() { this._clienteEmail = null; return this; }
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
src/builders/PedidoBuilder.js:10:21
   }
   comEmail(email) { this._clienteEmail = email; return this; }
   comValor(valor) { this._valor = valor; return this; }
-  comCartao(cartao) { this._cartao = cartao; return this; }
+  comCartao(cartao) {}
   semEmail() { this._clienteEmail = null; return this; }
   semCartao() { this._cartao = null; return this; }
killedBy: PedidoBuilder — comCartao() (mata NC1) comCartao deve substituir o cartão padrão pelo informado
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
src/builders/PedidoBuilder.js:11:14
   comEmail(email) { this._clienteEmail = email; return this; }
   comValor(valor) { this._valor = valor; return this; }
   comCartao(cartao) { this._cartao = cartao; return this; }
-  semEmail() { this._clienteEmail = null; return this; }
+  semEmail() {}
   semCartao() { this._cartao = null; return this; }
   semValor() { this._valor = null; return this; }
killedBy: CheckoutService PedidoBuilder — Data Builder Pattern deve construir pedido sem e-mail para testar validação
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
src/builders/PedidoBuilder.js:12:15
   comValor(valor) { this._valor = valor; return this; }
   comCartao(cartao) { this._cartao = cartao; return this; }
   semEmail() { this._clienteEmail = null; return this; }
-  semCartao() { this._cartao = null; return this; }
+  semCartao() {}
   semValor() { this._valor = null; return this; }
   build() {
killedBy: CheckoutService PedidoBuilder — Data Builder Pattern deve construir pedido sem cartão para testar validação
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
src/builders/PedidoBuilder.js:13:14
   comCartao(cartao) { this._cartao = cartao; return this; }
   semEmail() { this._clienteEmail = null; return this; }
   semCartao() { this._cartao = null; return this; }
-  semValor() { this._valor = null; return this; }
+  semValor() {}
   build() {
     return {
killedBy: PedidoBuilder — semValor() (mata NC2) semValor deve definir valor como null
statusReason: TypeError: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
src/builders/PedidoBuilder.js:14:11
   semEmail() { this._clienteEmail = null; return this; }
   semCartao() { this._cartao = null; return this; }
   semValor() { this._valor = null; return this; }
-  build() {
-    return {
-      clienteEmail: this._clienteEmail,
-      valor: this._valor,
-      cartao: this._cartao,
-      status: this._status
-    };
-  }
+  build() {}
 }
 module.exports = { PedidoBuilder };
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot set properties of undefined (setting 'status')

[Killed] ObjectLiteral
src/builders/PedidoBuilder.js:15:12
   semCartao() { this._cartao = null; return this; }
   semValor() { this._valor = null; return this; }
   build() {
-    return {
-      clienteEmail: this._clienteEmail,
-      valor: this._valor,
-      cartao: this._cartao,
-      status: this._status
-    };
+    return {};
   }
 }
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@email.com", "Pagamento Aprovado"
Received: undefined, "Pagamento Aprovado"

Number of calls: 1
