[Killed] BlockStatement
src/services/CheckoutService.js:2:65
 class CheckoutService {
-  constructor(gatewayPagamento, pedidoRepository, emailService) {
-    this.gatewayPagamento = gatewayPagamento;
-    this.pedidoRepository = pedidoRepository;
-    this.emailService = emailService;
-  }
+  constructor(gatewayPagamento, pedidoRepository, emailService) {}
 
   async processar(pedido) {
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: TypeError: Cannot read properties of undefined (reading 'salvar')

[Killed] BlockStatement
src/services/CheckoutService.js:8:27
     this.emailService = emailService;
   }
 
-  async processar(pedido) {
-    try {
-      const resposta = await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-      if (resposta.status === 'APROVADO') {
-        return await this._handleAprovado(pedido);
-      } else {
-        return await this._handleRecusado(pedido);
-      }
-    } catch (error) {
-      return await this._handleErroGateway(pedido, error);
-    }
-  }
+  async processar(pedido) {}
 
   async _handleAprovado(pedido) {
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:9:9
   }
 
   async processar(pedido) {
-    try {
-      const resposta = await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-      if (resposta.status === 'APROVADO') {
-        return await this._handleAprovado(pedido);
-      } else {
-        return await this._handleRecusado(pedido);
-      }
-    } catch (error) {
+    try {} catch (error) {
       return await this._handleErroGateway(pedido, error);
     }
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/services/CheckoutService.js:11:43
   async processar(pedido) {
     try {
       const resposta = await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-      if (resposta.status === 'APROVADO') {
-        return await this._handleAprovado(pedido);
-      } else {
+      if (resposta.status === 'APROVADO') {} else {
         return await this._handleRecusado(pedido);
       }
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/services/CheckoutService.js:11:11
   async processar(pedido) {
     try {
       const resposta = await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
-      if (resposta.status === 'APROVADO') {
+      if (resposta.status !== 'APROVADO') {
         return await this._handleAprovado(pedido);
       } else {
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) deve retornar o pedido salvo com status PROCESSADO
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/services/CheckoutService.js:13:14
       const resposta = await this.gatewayPagamento.cobrar(pedido.valor, pedido.cartao);
       if (resposta.status === 'APROVADO') {
         return await this._handleAprovado(pedido);
-      } else {
-        return await this._handleRecusado(pedido);
-      }
+      } else {}
     } catch (error) {
       return await this._handleErroGateway(pedido, error);
killedBy: CheckoutService Caminho N5 — pagamento RECUSADO (falha de negócio) deve retornar null quando o cartão é recusado
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:16:21
       } else {
         return await this._handleRecusado(pedido);
       }
-    } catch (error) {
-      return await this._handleErroGateway(pedido, error);
-    }
+    } catch (error) {}
   }
 
killedBy: CheckoutService — mensagem de erro do gateway (mata M6) deve logar mensagem específica quando o gateway falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha catastrófica no gateway bancário:", "connection refused"

Number of calls: 0

[Killed] BlockStatement
src/services/CheckoutService.js:21:33
     }
   }
 
-  async _handleAprovado(pedido) {
-    pedido.status = 'PROCESSADO';
-    const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
-    this.emailService
-      .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
-      .catch(err => console.error('Falha ao enviar e-mail:', err.message));
-    return pedidoSalvo;
-  }
+  async _handleAprovado(pedido) {}
 
   async _handleRecusado(pedido) {
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] StringLiteral
src/services/CheckoutService.js:25:47
     pedido.status = 'PROCESSADO';
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     this.emailService
-      .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
+      .enviarConfirmacao(pedido.clienteEmail, "")
       .catch(err => console.error('Falha ao enviar e-mail:', err.message));
     return pedidoSalvo;
killedBy: CheckoutService Caminho N4 — pagamento APROVADO (caminho feliz) MOCK — deve disparar o e-mail de confirmação para o cliente (comportamento)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "cliente@email.com", "Pagamento Aprovado"
Received: "cliente@email.com", ""

Number of calls: 1

[Killed] ArrowFunction
src/services/CheckoutService.js:26:14
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     this.emailService
       .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
-      .catch(err => console.error('Falha ao enviar e-mail:', err.message));
+      .catch(() => undefined);
     return pedidoSalvo;
   }
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar e-mail:", "SMTP indisponível"

Number of calls: 0

[Killed] StringLiteral
src/services/CheckoutService.js:26:35
     const pedidoSalvo = await this.pedidoRepository.salvar(pedido);
     this.emailService
       .enviarConfirmacao(pedido.clienteEmail, 'Pagamento Aprovado')
-      .catch(err => console.error('Falha ao enviar e-mail:', err.message));
+      .catch(err => console.error("", err.message));
     return pedidoSalvo;
   }
killedBy: CheckoutService — tratamento de falha no e-mail (mata M5) deve logar erro quando o envio de e-mail falha, sem derrubar o fluxo
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha ao enviar e-mail:", "SMTP indisponível"
Received: "", "SMTP indisponível"

Number of calls: 1

[Killed] BlockStatement
src/services/CheckoutService.js:30:33
     return pedidoSalvo;
   }
 
-  async _handleRecusado(pedido) {
-    pedido.status = 'FALHOU';
-    await this.pedidoRepository.salvar(pedido);
-    return null;
-  }
+  async _handleRecusado(pedido) {}
 
   async _handleErroGateway(pedido, error) {
killedBy: CheckoutService Caminho N5 — pagamento RECUSADO (falha de negócio) deve retornar null quando o cartão é recusado
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/services/CheckoutService.js:36:43
     return null;
   }
 
-  async _handleErroGateway(pedido, error) {
-    console.error('Falha catastrófica no gateway bancário:', error.message);
-    pedido.status = 'ERRO_GATEWAY';
-    await this.pedidoRepository.salvar(pedido);
-    return null;
-  }
+  async _handleErroGateway(pedido, error) {}
 }
 
killedBy: CheckoutService Caminho N6 — ERRO_GATEWAY (falha de infraestrutura / catch) deve retornar null quando o gateway lança exceção
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] StringLiteral
src/services/CheckoutService.js:37:19
   }
 
   async _handleErroGateway(pedido, error) {
-    console.error('Falha catastrófica no gateway bancário:', error.message);
+    console.error("", error.message);
     pedido.status = 'ERRO_GATEWAY';
     await this.pedidoRepository.salvar(pedido);
killedBy: CheckoutService — mensagem de erro do gateway (mata M6) deve logar mensagem específica quando o gateway falha
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Falha catastrófica no gateway bancário:", "connection refused"
Received: "", "connection refused"

Number of calls: 1
